export function getThaiWeekday(dateText: string): string | null {
    const cleaned = dateText.trim().replace(/-/g, "/");
    const d = new Date(cleaned);
    if (isNaN(d.getTime())) return null;
  
    const days = [
      "วันอาทิตย์",
      "วันจันทร์",
      "วันอังคาร",
      "วันพุธ",
      "วันพฤหัสบดี",
      "วันศุกร์",
      "วันเสาร์",
    ];
  
    return days[d.getDay()];
  }
  
//   export function getHoroscopeByDay(day: string): string {
//     const horoscope: Record<string, string> = {
//       "วันอาทิตย์": "เป็นคนใจใหญ่ มีภาวะผู้นำ การงานมีโอกาสเติบโต การเงินได้จากความสามารถ",
//       "วันจันทร์": "เป็นคนอ่อนโยน มีเสน่ห์ การเงินมาจากคนรอบข้าง ระวังอารมณ์ขึ้นลง",
//       "วันอังคาร": "ขยัน กล้าตัดสินใจ เหมาะกับงานลุยๆ ระวังคำพูดทำให้มีปัญหา",
//       "วันพุธ": "ฉลาด พูดเก่ง หาเงินได้หลายทาง ดวงค้าขายดี",
//       "วันพฤหัสบดี": "มีความรู้ ผู้ใหญ่สนับสนุน เหมาะกับงานวิชาการ การเงินมั่นคง",
//       "วันศุกร์": "มีเสน่ห์ รักสวยรักงาม หาเงินจากศิลปะ ความคิดสร้างสรรค์",
//       "วันเสาร์": "อดทนสูง ชีวิตก้าวหน้าช้าแต่มั่นคง สำเร็จจากความพยายาม",
//     };
  
//     return horoscope[day] || "ดวงโดยรวมอยู่ในเกณฑ์ดี";
//   }
  